Org-Mode_Fundamentals.org
#+PROPERTY: header-args :tangle "./.org-mode-fundamentals.emacs.el"

* Org-Mode Fundamentals
   :PROPERTIES:
   :ID:       orgmode:gcr:vela:7E71A009-4DD3-4296-9851-293BC71D2DFF
   :END:

Configure Org-Mode core functionality to compile this system.

Sysop is likely to use this periodically.

Start EMACS with this command:

=open /Applications/Emacs.app -n --args --quick --load ~/src/help/.org-mode-fundamentals.emacs.el=

#+NAME: BFE6C470-861B-4367-9735-DAA8E7C33C0A
#+BEGIN_SRC emacs-lisp :results output silent :comments no
;; -*- lexical-binding: t -*-
#+END_SRC

#+NAME: 78D777D3-FA69-4361-874C-7262DE96F753
#+BEGIN_SRC emacs-lisp :results output silent
(load-file "~/src/help/.org-mode-ecm.emacs.el")
#+END_SRC

** Literate Programming
  :PROPERTIES:
  :ID:       orgmode:gcr:vela:8510C876-F644-4804-9F87-54A0B44DBA6A
  :END:

#+MACRO: lp-configure-each-sb Configuration likely per Source-Block or System.

This system enables you to perform 3 Literate Document activities
- Tangling
- Evaluating
- Weaving

Combined they provide a rich Literate Programming environment.

These activities are not performed interactively by the user. They are automatic
operations that occur as a result of the configuration by the document itself.

The following is the guide for the default configuration of this system and how
it behaves.

Key:

- Columns
  - S :: Source document modified?
  - T :: Destination tangled-document modified?
  - W :: Destination weaved-document modified?
  - C :: Source-Block Evaluation occurred?
  - O :: Org-Macro Expansion occurred?

| Activity   | S | T | W | C | O |
|------------+---+---+---+---+---|
| Tangling   | F | T | F | F | F |
| Evaluating | T | F | F | T | F |
| Weaving    | F | F | T | F | T |

They are separate and distinct operations.

"Programming" is logically an activity that is the combination of these 3
activites. It is interactively performed by Sysop. It is not a distinct
or isolated operation. Results of one activity exist here and serve as inputs to
another activity.

