Org-Mode_Fundamentals.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2016-09-01 Thu 19:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<meta name="generator" content="Org-mode">
<meta name="author" content="Grant Rettke">
</head>
<body>
<div id="content">

<div id="outline-container-org2494334" class="outline-2">
<h2 id="org2494334"><a id="orgmode:gcr:vela:7E71A009-4DD3-4296-9851-293BC71D2DFF"></a><span class="section-number-2">1</span> Org-Mode Fundamentals</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: orgmode:gcr:vela:7E71A009-4DD3-4296-9851-293BC71D2DFF
</pre>

<p>
Configure Org-Mode core functionality to compile this system.
</p>

<p>
Sysop is likely to use this periodically.
</p>

<p>
Start EMACS with this command:
</p>

<p>
<code>open /Applications/Emacs.app -n --args --quick --load ~/src/help/.org-mode-fundamentals.emacs.el</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org862a456"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- lexical-binding: t -*-</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org545952a">(load-file <span class="org-string">"~/src/help/.org-mode-ecm.emacs.el"</span>)
</pre>
</div>
</div>

<div id="outline-container-orgebf3de2" class="outline-3">
<h3 id="orgebf3de2"><a id="orgmode:gcr:vela:8510C876-F644-4804-9F87-54A0B44DBA6A"></a><span class="section-number-3">1.1</span> Literate Programming</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: orgmode:gcr:vela:8510C876-F644-4804-9F87-54A0B44DBA6A
</pre>

<p>
This system enables you to perform 3 Literate Document activities
</p>
<ul class="org-ul">
<li>Tangling</li>
<li>Evaluating</li>
<li>Weaving</li>
</ul>

<p>
Combined they provide a rich Literate Programming environment.
</p>

<p>
These activities are not performed interactively by the user. They are automatic
operations that occur as a result of the configuration by the document itself.
</p>

<p>
The following is the guide for the default configuration of this system and how
it behaves.
</p>

<p>
Key:
</p>

<ul class="org-ul">
<li>Columns
<dl class="org-dl">
<dt>S</dt><dd>Source document modified?</dd>
<dt>T</dt><dd>Destination tangled-document modified?</dd>
<dt>W</dt><dd>Destination weaved-document modified?</dd>
<dt>C</dt><dd>Source-Block Evaluation occurred?</dd>
<dt>O</dt><dd>Org-Macro Expansion occurred?</dd>
</dl></li>
</ul>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Activity</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">T</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">O</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tangling</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">Evaluating</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>

<tr>
<td class="org-left">Weaving</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
</tr>
</tbody>
</table>

<p>
They are separate and distinct operations.
</p>

<p>
&ldquo;Programming&rdquo; is logically an activity that is the combination of these 3
activites. It is interactively performed by Sysop. It is not a distinct
or isolated operation. Results of one activity exist here and serve as inputs to
another activity.
</p>
</div>
