Org-Mode_Fundamentals.md

# Org-Mode Fundamentals

    ID: 7E71A009-4DD3-4296-9851-293BC71D2DFF

Configure Org-Mode core functionality to compile this system.

Sysop is likely to use this periodically.

Start EMACS with this command:

`open /Applications/Emacs.app -n --args --quick --load ~/src/help/.org-mode-fundamentals.emacs.el`

```lisp
;; -*- lexical-binding: t -*-
```

```lisp
(load-file "~/src/help/.org-mode-ecm.emacs.el")
```

## Literate Programming

    ID: 8510C876-F644-4804-9F87-54A0B44DBA6A

This system enables you to perform 3 Literate Document activities

-   Tangling
-   Evaluating
-   Weaving

Combined they provide a rich Literate Programming environment.

These activities are not performed interactively by the user. They are automatic
operations that occur as a result of the configuration by the document itself.

The following is the guide for the default configuration of this system and how
it behaves.

Key:

-   Columns
    -   **S:** Source document modified?
    -   **T:** Destination tangled-document modified?
    -   **W:** Destination weaved-document modified?
    -   **C:** Source-Block Evaluation occurred?
    -   **O:** Org-Macro Expansion occurred?

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Activity</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">T</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">O</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Tangling</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>


<tr>
<td class="org-left">Evaluating</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
</tr>


<tr>
<td class="org-left">Weaving</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
<td class="org-left">F</td>
<td class="org-left">T</td>
</tr>
</tbody>
</table>

They are separate and distinct operations.

&ldquo;Programming&rdquo; is logically an activity that is the combination of these 3
activites. It is interactively performed by Sysop. It is not a distinct
or isolated operation. Results of one activity exist here and serve as inputs to
another activity.
