Org-Mode_Fundamentals.html

<div id="outline-container-orgeb38830" class="outline-4">
<h4 id="orgeb38830"><a id="orgmode:gcr:vela:B14776FD-6835-4D1D-BCD3-50D56555423C"></a><span class="section-number-4">1.1.1</span> Helper Functions</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example">
ID: orgmode:gcr:vela:B14776FD-6835-4D1D-BCD3-50D56555423C
</pre>

<p>
Help configure Org-Mode.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org04ed9ee">(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-header-args</span> (property value)
  <span class="org-doc">"Easily set system header arguments in org mode.</span>

<span class="org-doc">PROPERTY is the system-wide value that you would like to modify.</span>

<span class="org-doc">VALUE is the new value you wish to store.</span>

<span class="org-doc">Attribution: URL `http://orgmode.org/manual/System_002dwide-header-arguments.html#System_002dwide-header-arguments'"</span>
  (setq org-babel-default-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-inline-header-args</span> (property value)
  <span class="org-doc">"See `</span><span class="org-doc"><span class="org-constant">help/set-org-babel-default-header-args</span></span><span class="org-doc">'; same but for inline header args."</span>
  (setq org-babel-default-inline-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-inline-header-args))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-header-args:R</span> (property value)
  <span class="org-doc">"See `</span><span class="org-doc"><span class="org-constant">help/set-org-babel-default-header-args</span></span><span class="org-doc">'; same but for R.</span>

<span class="org-doc">This is a copy and paste. Additional languages would warrant a refactor."</span>
  (setq org-babel-default-header-args:R
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:R))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-header-args:ditaa</span> (property value)
  <span class="org-doc">"See `</span><span class="org-doc"><span class="org-constant">help/set-org-babel-default-header-args</span></span><span class="org-doc">'; same but for ditaa.</span>

<span class="org-doc">This is a copy and paste. Additional languages would warrant a refactor."</span>
  (setq org-babel-default-header-args:ditaa
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:ditaa))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-header-args:dot</span> (property value)
  <span class="org-doc">"See `</span><span class="org-doc"><span class="org-constant">help/set-org-babel-default-header-args</span></span><span class="org-doc">'; same but for dot.</span>

<span class="org-doc">This is a copy and paste. Additional languages would warrant a refactor."</span>
  (setq org-babel-default-header-args:dot
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:dot))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/set-org-babel-default-header-args:plantuml</span> (property value)
  <span class="org-doc">"See `</span><span class="org-doc"><span class="org-constant">help/set-org-babel-default-header-args</span></span><span class="org-doc">'; same but for plantuml.</span>

<span class="org-doc">This is a copy and paste. Additional languages would warrant a refactor."</span>
  (setq org-babel-default-header-args:plantuml
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:plantuml))))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-toggle-macro-markers</span> ()
  (interactive)
  (setq org-hide-macro-markers (not org-hide-macro-markers)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-prp-hdln</span> ()
  <span class="org-doc">"Visit every Headline. If it doesn't have an ID property then add one and</span>
<span class="org-doc">  assign it a UUID. Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://article.gmane.org/gmane.emacs.orgmode/99738</span></span><span class="org-doc">'"</span>
  (interactive)
  (<span class="org-keyword">save-excursion</span>
    (goto-char (point-min))
    (<span class="org-keyword">dolist</span> (p (nreverse
                (org-element-map (org-element-parse-buffer 'headline) 'headline
                  (<span class="org-keyword">lambda</span> (headline) (org-element-property <span class="org-builtin">:begin</span> headline)))))
      (goto-char p)
      (org-id-get-create))
    (save-buffer)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-prp-src-blk</span> ()
  <span class="org-doc">"If it doesn't have a NAME property then add one and</span>
<span class="org-doc">   assign it a UUID. Attribution: URL `</span><span class="org-doc"><span class="org-constant">http://article.gmane.org/gmane.emacs.orgmode/99740</span></span><span class="org-doc">'"</span>
  (interactive)
  (help/org-2every-src-block
   #'(<span class="org-keyword">lambda</span> (element)
       (<span class="org-keyword">if</span> (not (org-element-property <span class="org-builtin">:name</span> element))
           (<span class="org-keyword">let</span> ((i (org-get-indentation)))
             (beginning-of-line)
             (<span class="org-keyword">save-excursion</span> (insert <span class="org-string">"#+NAME: orgmode:gcr:vela:"</span> (org-id-new) <span class="org-string">"\n"</span>))
             (indent-to i)
             (forward-line 2))))))

(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/org-special-pre</span> <span class="org-string">"^\s*#[+]"</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-2every-src-block</span> (fn)
  <span class="org-doc">"Visit every Source-Block and evaluate `</span><span class="org-doc"><span class="org-constant">FN</span></span><span class="org-doc">'."</span>
  (interactive)
  (<span class="org-keyword">save-excursion</span>
    (goto-char (point-min))
    (<span class="org-keyword">let</span> ((case-fold-search t))
      (<span class="org-keyword">while</span> (re-search-forward (concat help/org-special-pre <span class="org-string">"BEGIN_SRC"</span>) nil t)
        (<span class="org-keyword">let</span> ((element (org-element-at-point)))
          (<span class="org-keyword">when</span> (eq (org-element-type element) 'src-block)
            (funcall fn element)))))
    (save-buffer)))

(<span class="org-keyword">defun</span> <span class="org-function-name">help/org-babel-demarcate-block</span> ()
  <span class="org-doc">"Add a NAME property then assign it a UUID."</span>
  (interactive)
  (org-babel-demarcate-block)
  (insert <span class="org-string">"#+NAME: orgmode:gcr:vela:"</span> (org-id-new))
  (beginning-of-line)
  (insert <span class="org-string">"\n"</span>))
</pre>
</div>
</div>
</div>
