Org-Mode_Fundamentals.org
*** Identity
:PROPERTIES:
:ID:       orgmode:gcr:vela:25F4226F-2EB2-48EC-A4D5-56DD5CCC753E
:END:

A Headline's primary key is =ID=. Use =org-id= to manage it.

#+NAME: orgmode:gcr:vela:659CE55F-3CEA-4940-9D5E-5C66258BFE8F
#+BEGIN_SRC emacs-lisp :results output silent
(require 'org-id)
#+END_SRC

In Links: Never use =ID= or =CUSTOM_ID=; always use the file name and text to make
it accessible outside of Emacs.

#+NAME: 751D537A-EE89-4B1D-91E5-99D3A4F8B52E
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-id-link-to-org-use-id 'nil)
#+END_SRC

Make sure that =ID= is always unique, portable, and easy to maintain by
- Using a memorable prefix
  - Must be both LaTeX label and XHTML identifier compliant
- Include the current login
- Include the current domain
- Use a UUID

#+NAME: 885C8386-AC68-4DB7-8D04-537E28ED950B
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-id-prefix (concat "orgmode:" (user-real-login-name) ":" (system-name)))
(setq org-id-method 'uuid)
#+END_SRC

*** Tangling
   :PROPERTIES:
   :ID:       orgmode:gcr:vela:267EEDED-1367-405F-807C-B3C489045704
   :END:

=ID= and =NAME= are essential for successful =LP= using ~org-babel-tangle-jump-to-org~.

#+NAME: 859E61A4-D910-4731-8328-A63F6B6ACD3F
#+BEGIN_SRC emacs-lisp :results output silent
(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-hdln)
(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-src-blk)
#+END_SRC

There is a way to disable property inheritance that speeds up tangling a lot.
This is only for user-defined properties; *not* Org-Mode properties.

The problem is that you lose property inheritance which is unacceptable. Never,
never allow that. Its inconsistent with how Org-Mode works.

#+NAME: F19C629B-E784-48CA-BC53-CCFB849CE9EC
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-babel-use-quick-and-dirty-noweb-expansion nil)
#+END_SRC

Assume that tangled document always live within the same directory structure
as their origin document.

#+NAME: orgmode:gcr:vela:F7F35A40-EE63-48B1-8D5D-F745525D9996
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-babel-tangle-use-relative-file-links t)
#+END_SRC

**** comments
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:49787FC5-CAA7-466B-B742-0F38973E070B
    :END:

#+BEGIN_QUOTE
Toggle insertion of comments in tangled code files
#+END_QUOTE

Provide as much information as possible in the tangled artifact about the
origin artifact.

#+NAME: AD42B561-29FA-4652-AD28-692CAD631E62
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :comments "noweb")
#+END_SRC

**** mkdirp
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:B0F9A321-3B69-46BB-B512-0AF3C663A4C0
    :END:

#+BEGIN_QUOTE
Toggle creation of parent directories of target files during tangling
#+END_QUOTE

#+NAME: F501D202-9F0B-4343-B257-E0DEB4483A0B
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :mkdirp "yes")
#+END_SRC

**** no-expand
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:90170E6A-AA1A-44EA-9BF8-1A6AA38FD224
    :END:

#+BEGIN_QUOTE
Turn off variable assignment and noweb expansion during tangling
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** noweb
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:E12B48AB-68E8-4515-89E3-30A16FB6FD22
    :END:

#+BEGIN_QUOTE
Toggle expansion of noweb references
#+END_QUOTE

Expand noweb references in source-blocks before:

| Activity   | Expand |
|------------+--------|
| Tangling   | T      |
| Evaluating | T      |
| Weaving    | F      |

This embraces the notion that you are telling the right thing to the
computer and the right thing to the human. By the time you get to exporting, you
ought to refer to the generated document.

#+NAME: 20BE9B4B-ED66-4935-A351-99D17B3A32D4
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :noweb "no-export")
#+END_SRC

**** noweb-ref
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:2836D0AA-5DBA-48AC-A338-B47002DE8D7F
    :END:

#+BEGIN_QUOTE
Specify block's noweb reference resolution target
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** noweb-sep
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:B1A57D15-6BBF-4E78-A0D9-0B02C283C6B0
    :END:

#+BEGIN_QUOTE
String used to separate noweb references
#+END_QUOTE

{{{lp-configure-each-sb}}}

