Org-Mode_Fundamentals.html

<div id="outline-container-orgc81bb8e" class="outline-4">
<h4 id="orgc81bb8e"><a id="orgmode:gcr:vela:25F4226F-2EB2-48EC-A4D5-56DD5CCC753E"></a><span class="section-number-4">1.1.2</span> Identity</h4>
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
ID: orgmode:gcr:vela:25F4226F-2EB2-48EC-A4D5-56DD5CCC753E
</pre>

<p>
A Headline&rsquo;s primary key is <code>ID</code>. Use <code>org-id</code> to manage it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgdfa74f0">(<span class="org-keyword">require</span> '<span class="org-constant">org-id</span>)
</pre>
</div>

<p>
In Links: Never use <code>ID</code> or <code>CUSTOM_ID</code>; always use the file name and text to make
it accessible outside of Emacs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orga238d43">(setq org-id-link-to-org-use-id 'nil)
</pre>
</div>

<p>
Make sure that <code>ID</code> is always unique, portable, and easy to maintain by
</p>
<ul class="org-ul">
<li>Using a memorable prefix
<ul class="org-ul">
<li>Must be both LaTeX label and XHTML identifier compliant</li>
</ul></li>
<li>Include the current login</li>
<li>Include the current domain</li>
<li>Use a UUID</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orge5f2d33">(setq org-id-prefix (concat <span class="org-string">"orgmode:"</span> (user-real-login-name) <span class="org-string">":"</span> (system-name)))
(setq org-id-method 'uuid)
</pre>
</div>
</div>
</div>

<div id="outline-container-org127fab5" class="outline-4">
<h4 id="org127fab5"><a id="orgmode:gcr:vela:267EEDED-1367-405F-807C-B3C489045704"></a><span class="section-number-4">1.1.3</span> Tangling</h4>
<div class="outline-text-4" id="text-1-1-3">
<pre class="example">
ID: orgmode:gcr:vela:267EEDED-1367-405F-807C-B3C489045704
</pre>

<p>
<code>ID</code> and <code>NAME</code> are essential for successful <code>LP</code> using <code>org-babel-tangle-jump-to-org</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org950c539">(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-hdln)
(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-src-blk)
</pre>
</div>

<p>
There is a way to disable property inheritance that speeds up tangling a lot.
This is only for user-defined properties; <b>not</b> Org-Mode properties.
</p>

<p>
The problem is that you lose property inheritance which is unacceptable. Never,
never allow that. Its inconsistent with how Org-Mode works.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org9525a79">(setq org-babel-use-quick-and-dirty-noweb-expansion nil)
</pre>
</div>

<p>
Assume that tangled document always live within the same directory structure
as their origin document.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org910e37a">(setq org-babel-tangle-use-relative-file-links t)
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="org661dd2f"></a><a id="orgmode:gcr:vela:49787FC5-CAA7-466B-B742-0F38973E070B"></a>comments<br ><div class="outline-text-5" id="text-1-1-3-1">
<pre class="example">
ID: orgmode:gcr:vela:49787FC5-CAA7-466B-B742-0F38973E070B
</pre>

<blockquote>
<p>
Toggle insertion of comments in tangled code files
</p>
</blockquote>

<p>
Provide as much information as possible in the tangled artifact about the
origin artifact.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org836b87b">(help/set-org-babel-default-header-args <span class="org-builtin">:comments</span> <span class="org-string">"noweb"</span>)
</pre>
</div>
</div></li>

<li><a id="org23efaec"></a><a id="orgmode:gcr:vela:B0F9A321-3B69-46BB-B512-0AF3C663A4C0"></a>mkdirp<br ><div class="outline-text-5" id="text-1-1-3-2">
<pre class="example">
ID: orgmode:gcr:vela:B0F9A321-3B69-46BB-B512-0AF3C663A4C0
</pre>

<blockquote>
<p>
Toggle creation of parent directories of target files during tangling
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org04a1440">(help/set-org-babel-default-header-args <span class="org-builtin">:mkdirp</span> <span class="org-string">"yes"</span>)
</pre>
</div>
</div></li>

<li><a id="orgf4984b0"></a><a id="orgmode:gcr:vela:90170E6A-AA1A-44EA-9BF8-1A6AA38FD224"></a>no-expand<br ><div class="outline-text-5" id="text-1-1-3-3">
<pre class="example">
ID: orgmode:gcr:vela:90170E6A-AA1A-44EA-9BF8-1A6AA38FD224
</pre>

<blockquote>
<p>
Turn off variable assignment and noweb expansion during tangling
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org5413e78"></a><a id="orgmode:gcr:vela:E12B48AB-68E8-4515-89E3-30A16FB6FD22"></a>noweb<br ><div class="outline-text-5" id="text-1-1-3-4">
<pre class="example">
ID: orgmode:gcr:vela:E12B48AB-68E8-4515-89E3-30A16FB6FD22
</pre>

<blockquote>
<p>
Toggle expansion of noweb references
</p>
</blockquote>

<p>
Expand noweb references in source-blocks before:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Activity</th>
<th scope="col" class="org-left">Expand</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tangling</td>
<td class="org-left">T</td>
</tr>

<tr>
<td class="org-left">Evaluating</td>
<td class="org-left">T</td>
</tr>

<tr>
<td class="org-left">Weaving</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>

<p>
This embraces the notion that you are telling the right thing to the
computer and the right thing to the human. By the time you get to exporting, you
ought to refer to the generated document.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgb5941f4">(help/set-org-babel-default-header-args <span class="org-builtin">:noweb</span> <span class="org-string">"no-export"</span>)
</pre>
</div>
</div></li>

<li><a id="org3b10bd5"></a><a id="orgmode:gcr:vela:2836D0AA-5DBA-48AC-A338-B47002DE8D7F"></a>noweb-ref<br ><div class="outline-text-5" id="text-1-1-3-5">
<pre class="example">
ID: orgmode:gcr:vela:2836D0AA-5DBA-48AC-A338-B47002DE8D7F
</pre>

<blockquote>
<p>
Specify block&rsquo;s noweb reference resolution target
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org0be7322"></a><a id="orgmode:gcr:vela:B1A57D15-6BBF-4E78-A0D9-0B02C283C6B0"></a>noweb-sep<br ><div class="outline-text-5" id="text-1-1-3-6">
<pre class="example">
ID: orgmode:gcr:vela:B1A57D15-6BBF-4E78-A0D9-0B02C283C6B0
</pre>

<blockquote>
<p>
String used to separate noweb references
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>
