Org-Mode_Fundamentals.md

### Tangling

    ID: 267EEDED-1367-405F-807C-B3C489045704

`ID` and `NAME` are essential for successful `LP` using `org-babel-tangle-jump-to-org`.

```lisp
(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-hdln)
(add-hook 'org-babel-pre-tangle-hook #'help/org-prp-src-blk)
```

There is a way to disable property inheritance that speeds up tangling a lot.
This is only for user-defined properties; **not** Org-Mode properties.

The problem is that you lose property inheritance which is unacceptable. Never,
never allow that. Its inconsistent with how Org-Mode works.

```lisp
(setq org-babel-use-quick-and-dirty-noweb-expansion nil)
```

1.  comments

        ID: 49787FC5-CAA7-466B-B742-0F38973E070B

    > Toggle insertion of comments in tangled code files

    Provide as much information as possible in the tangled artifact about the
    origin artifact.

    ```lisp
    (help/set-org-babel-default-header-args :comments "noweb")
    ```

2.  mkdirp

        ID: B0F9A321-3B69-46BB-B512-0AF3C663A4C0

    > Toggle creation of parent directories of target files during tangling

    ```lisp
    (help/set-org-babel-default-header-args :mkdirp "yes")
    ```

3.  no-expand

        ID: 90170E6A-AA1A-44EA-9BF8-1A6AA38FD224

    > Turn off variable assignment and noweb expansion during tangling

    Configuration likely per Source-Block or System.

4.  noweb

        ID: E12B48AB-68E8-4515-89E3-30A16FB6FD22

    > Toggle expansion of noweb references

    Expand noweb references in source-blocks before:

    <table>


    <colgroup>
    <col  class="org-left">

    <col  class="org-left">
    </colgroup>
    <thead>
    <tr>
    <th scope="col" class="org-left">Activity</th>
    <th scope="col" class="org-left">Expand</th>
    </tr>
    </thead>

    <tbody>
    <tr>
    <td class="org-left">Tangling</td>
    <td class="org-left">T</td>
    </tr>


    <tr>
    <td class="org-left">Evaluating</td>
    <td class="org-left">T</td>
    </tr>


    <tr>
    <td class="org-left">Weaving</td>
    <td class="org-left">F</td>
    </tr>
    </tbody>
    </table>

    This embraces the notion that you are telling the right thing to the
    computer and the right thing to the human. By the time you get to exporting, you
    ought to refer to the generated document.

    ```lisp
    (help/set-org-babel-default-header-args :noweb "no-export")
    ```

5.  noweb-ref

        ID: 2836D0AA-5DBA-48AC-A338-B47002DE8D7F

    > Specify block&rsquo;s noweb reference resolution target

    Configuration likely per Source-Block or System.

6.  noweb-sep

        ID: B1A57D15-6BBF-4E78-A0D9-0B02C283C6B0

    > String used to separate noweb references

    Configuration likely per Source-Block or System.

7.  padline
