Org-Mode_Fundamentals.org
**** padline
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:DDE727A6-DDF7-4B61-9063-549614B135F0
    :END:

#+BEGIN_QUOTE
Control insertion of padding lines in tangled code files
#+END_QUOTE

- ~org-babel-tangle-jump-to-org~ requires padded lines. This configuration could
  arguably appear in the "Programming" heading because it impacts operation. It
  lives here because it *must* occur as part of the Tangling activity so that it
  can be used in the Programming activity.
- Often I go back and for on this one. Sometimes it is nicer to have less spaces
  in generated code when guests are viewing it. When no one else is reading it
  I love the spaces. Defaulting to what I like.

#+NAME: 0F3E7114-A63C-44F4-A9FD-577BAEE536ED
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :padline "yes")
#+END_SRC

**** session
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:8219A42A-E90F-418A-8EF0-EB150CF6D730
    :END:

#+BEGIN_QUOTE
Preserve the state of code evaluation
#+END_QUOTE

{{{lp-configure-each-sb}}}

For some situations, this may be the same for every source block for a
particular language. R is a good example.

**** shebang
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:542185DD-4FD6-459A-B422-DA7B546FB292
    :END:

#+BEGIN_QUOTE
Make tangled files executable
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** tangle
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:EA716FC9-4A90-4F3E-ABD0-31FEA575C969
    :END:

#+BEGIN_QUOTE
Toggle tangling and specify file name
#+END_QUOTE

#+NAME: 5E69E152-9921-4527-A2B2-24467EEF1BE9
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :tangle "no")
#+END_SRC

**** tangle-mode
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:5F0B7157-2DC8-4AFD-8F26-4B21025A5ECE
    :END:

#+BEGIN_QUOTE
Set permission of tangled files
#+END_QUOTE

{{{lp-configure-each-sb}}}

*** Evaluating
   :PROPERTIES:
   :ID:       orgmode:gcr:vela:ED23FF0B-1F90-435C-9B56-ACA06C1ACAE0
   :END:

Org-Mode may evaluate all of the listed languages.

#+NAME: 6309AF39-FCE4-43DE-BD46-BC7D0BA0971D
#+BEGIN_SRC emacs-lisp :results output silent
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (org . t)
   ;;
   (C . t)
   (R . t)
   (python . t)
   (sass . t)
   (scheme . t)
   (sql . t)
   ;;
   (latex . t)
   ;;
   (makefile . t)
   (shell . t)
   ;;
   (ditaa . t)
   (dot . t)
   (plantuml . t)))
#+END_SRC

**** cache
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:49B8BFE9-643B-450F-A8A1-20CE3079E215
    :END:

#+BEGIN_QUOTE
Avoid re-evaluating unchanged code blocks
#+END_QUOTE

{{{lp-configure-each-sb}}}

Default =no= is correct for nearly every scenario.

**** colnames
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:4D683007-14AE-4A7D-A506-E2301FD32E82
    :END:

#+BEGIN_QUOTE
Handle column names in tables
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** dir
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:CD1494F1-0A2A-44D0-9955-0D0501AF1539
    :END:

#+BEGIN_QUOTE
Specify the default (possibly remote) directory for code block execution
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** epilogue
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:CA7F5086-9D4B-4847-9449-3231CE027804
    :END:

#+BEGIN_QUOTE
Text to append to code block body
#+END_QUOTE

See Prologue.

**** eval
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:0329BACE-2C99-4BB3-A7A5-7C800EF53FAD
    :END:

#+BEGIN_QUOTE
Limit evaluation of specific code blocks
#+END_QUOTE

Never evaluate source-blocks or in-line-source-blocks *on export*.

#+NAME: 58541CA5-C633-4146-8E5D-15C7A3A2D1D7
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :eval "never-export")
(help/set-org-babel-default-inline-header-args :eval "never-export")
#+END_SRC

Never evaluate in-line-source-blocks *on export*.

#+NAME: D9F32A22-B415-48EA-A189-D8EAF7C202D8
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-babel-evaluate nil)
#+END_SRC

**** file
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:80824708-62AF-4337-A517-828DA22D1FCA
    :END:

#+BEGIN_QUOTE
Specify a path for file output
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** file-desc
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:6F9A2745-7118-469E-9FDB-4B327C02E5FA
    :END:

#+BEGIN_QUOTE
Specify a description for file results
#+END_QUOTE

{{{lp-configure-each-sb}}}

**** file-ext
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:0716A48E-9227-44FD-B1FA-185DF6545E91
    :END:

#+BEGIN_QUOTE
Specify an extension for file output
#+END_QUOTE

{{{lp-configure-each-sb}}}

