Org-Mode_Fundamentals.html

<li><a id="org21452f6"></a><a id="orgmode:gcr:vela:DDE727A6-DDF7-4B61-9063-549614B135F0"></a>padline<br ><div class="outline-text-5" id="text-1-1-3-7">
<pre class="example">
ID: orgmode:gcr:vela:DDE727A6-DDF7-4B61-9063-549614B135F0
</pre>

<blockquote>
<p>
Control insertion of padding lines in tangled code files
</p>
</blockquote>

<ul class="org-ul">
<li><code>org-babel-tangle-jump-to-org</code> requires padded lines. This configuration could
arguably appear in the &ldquo;Programming&rdquo; heading because it impacts operation. It
lives here because it <b>must</b> occur as part of the Tangling activity so that it
can be used in the Programming activity.</li>
<li>Often I go back and for on this one. Sometimes it is nicer to have less spaces
in generated code when guests are viewing it. When no one else is reading it
I love the spaces. Defaulting to what I like.</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgca11036">(help/set-org-babel-default-header-args <span class="org-builtin">:padline</span> <span class="org-string">"yes"</span>)
</pre>
</div>
</div></li>

<li><a id="org5907574"></a><a id="orgmode:gcr:vela:8219A42A-E90F-418A-8EF0-EB150CF6D730"></a>session<br ><div class="outline-text-5" id="text-1-1-3-8">
<pre class="example">
ID: orgmode:gcr:vela:8219A42A-E90F-418A-8EF0-EB150CF6D730
</pre>

<blockquote>
<p>
Preserve the state of code evaluation
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>

<p>
For some situations, this may be the same for every source block for a
particular language. R is a good example.
</p>
</div></li>

<li><a id="orga148a09"></a><a id="orgmode:gcr:vela:542185DD-4FD6-459A-B422-DA7B546FB292"></a>shebang<br ><div class="outline-text-5" id="text-1-1-3-9">
<pre class="example">
ID: orgmode:gcr:vela:542185DD-4FD6-459A-B422-DA7B546FB292
</pre>

<blockquote>
<p>
Make tangled files executable
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="orgcfbf812"></a><a id="orgmode:gcr:vela:EA716FC9-4A90-4F3E-ABD0-31FEA575C969"></a>tangle<br ><div class="outline-text-5" id="text-1-1-3-10">
<pre class="example">
ID: orgmode:gcr:vela:EA716FC9-4A90-4F3E-ABD0-31FEA575C969
</pre>

<blockquote>
<p>
Toggle tangling and specify file name
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgd8e5c9e">(help/set-org-babel-default-header-args <span class="org-builtin">:tangle</span> <span class="org-string">"no"</span>)
</pre>
</div>
</div></li>

<li><a id="org230ebaa"></a><a id="orgmode:gcr:vela:5F0B7157-2DC8-4AFD-8F26-4B21025A5ECE"></a>tangle-mode<br ><div class="outline-text-5" id="text-1-1-3-11">
<pre class="example">
ID: orgmode:gcr:vela:5F0B7157-2DC8-4AFD-8F26-4B21025A5ECE
</pre>

<blockquote>
<p>
Set permission of tangled files
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li></ol>
</div>

<div id="outline-container-orgb74480a" class="outline-4">
<h4 id="orgb74480a"><a id="orgmode:gcr:vela:ED23FF0B-1F90-435C-9B56-ACA06C1ACAE0"></a><span class="section-number-4">1.1.4</span> Evaluating</h4>
<div class="outline-text-4" id="text-1-1-4">
<pre class="example">
ID: orgmode:gcr:vela:ED23FF0B-1F90-435C-9B56-ACA06C1ACAE0
</pre>

<p>
Org-Mode may evaluate all of the listed languages.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orge7617f9">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (org . t)
   <span class="org-comment-delimiter">;;</span>
   (C . t)
   (R . t)
   (python . t)
   (sass . t)
   (scheme . t)
   (sql . t)
   <span class="org-comment-delimiter">;;</span>
   (latex . t)
   <span class="org-comment-delimiter">;;</span>
   (makefile . t)
   (shell . t)
   <span class="org-comment-delimiter">;;</span>
   (ditaa . t)
   (dot . t)
   (plantuml . t)))
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="org8627abe"></a><a id="orgmode:gcr:vela:49B8BFE9-643B-450F-A8A1-20CE3079E215"></a>cache<br ><div class="outline-text-5" id="text-1-1-4-1">
<pre class="example">
ID: orgmode:gcr:vela:49B8BFE9-643B-450F-A8A1-20CE3079E215
</pre>

<blockquote>
<p>
Avoid re-evaluating unchanged code blocks
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>

<p>
Default <code>no</code> is correct for nearly every scenario.
</p>
</div></li>

<li><a id="org27a1791"></a><a id="orgmode:gcr:vela:4D683007-14AE-4A7D-A506-E2301FD32E82"></a>colnames<br ><div class="outline-text-5" id="text-1-1-4-2">
<pre class="example">
ID: orgmode:gcr:vela:4D683007-14AE-4A7D-A506-E2301FD32E82
</pre>

<blockquote>
<p>
Handle column names in tables
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org504fea4"></a><a id="orgmode:gcr:vela:CD1494F1-0A2A-44D0-9955-0D0501AF1539"></a>dir<br ><div class="outline-text-5" id="text-1-1-4-3">
<pre class="example">
ID: orgmode:gcr:vela:CD1494F1-0A2A-44D0-9955-0D0501AF1539
</pre>

<blockquote>
<p>
Specify the default (possibly remote) directory for code block execution
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org3878c50"></a><a id="orgmode:gcr:vela:CA7F5086-9D4B-4847-9449-3231CE027804"></a>epilogue<br ><div class="outline-text-5" id="text-1-1-4-4">
<pre class="example">
ID: orgmode:gcr:vela:CA7F5086-9D4B-4847-9449-3231CE027804
</pre>

<blockquote>
<p>
Text to append to code block body
</p>
</blockquote>

<p>
See Prologue.
</p>
</div></li>

<li><a id="org8bc348d"></a><a id="orgmode:gcr:vela:0329BACE-2C99-4BB3-A7A5-7C800EF53FAD"></a>eval<br ><div class="outline-text-5" id="text-1-1-4-5">
<pre class="example">
ID: orgmode:gcr:vela:0329BACE-2C99-4BB3-A7A5-7C800EF53FAD
</pre>

<blockquote>
<p>
Limit evaluation of specific code blocks
</p>
</blockquote>

<p>
Never evaluate source-blocks or in-line-source-blocks <b>on export</b>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgd3aa79c">(help/set-org-babel-default-header-args <span class="org-builtin">:eval</span> <span class="org-string">"never-export"</span>)
(help/set-org-babel-default-inline-header-args <span class="org-builtin">:eval</span> <span class="org-string">"never-export"</span>)
</pre>
</div>

<p>
Never evaluate in-line-source-blocks <b>on export</b>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgccc0841">(setq org-export-babel-evaluate nil)
</pre>
</div>
</div></li>

<li><a id="org3ebc2b7"></a><a id="orgmode:gcr:vela:80824708-62AF-4337-A517-828DA22D1FCA"></a>file<br ><div class="outline-text-5" id="text-1-1-4-6">
<pre class="example">
ID: orgmode:gcr:vela:80824708-62AF-4337-A517-828DA22D1FCA
</pre>

<blockquote>
<p>
Specify a path for file output
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org30e84fe"></a><a id="orgmode:gcr:vela:6F9A2745-7118-469E-9FDB-4B327C02E5FA"></a>file-desc<br ><div class="outline-text-5" id="text-1-1-4-7">
<pre class="example">
ID: orgmode:gcr:vela:6F9A2745-7118-469E-9FDB-4B327C02E5FA
</pre>

<blockquote>
<p>
Specify a description for file results
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="orge4799a0"></a><a id="orgmode:gcr:vela:0716A48E-9227-44FD-B1FA-185DF6545E91"></a>file-ext<br ><div class="outline-text-5" id="text-1-1-4-8">
<pre class="example">
ID: orgmode:gcr:vela:0716A48E-9227-44FD-B1FA-185DF6545E91
</pre>

<blockquote>
<p>
Specify an extension for file output
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>
