Org-Mode_Fundamentals.md

        ID: DDE727A6-DDF7-4B61-9063-549614B135F0

    > Control insertion of padding lines in tangled code files

    -   `org-babel-tangle-jump-to-org` requires padded lines. This configuration could
        arguably appear in the &ldquo;Programming&rdquo; heading because it impacts operation. It
        lives here because it **must** occur as part of the Tangling activity so that it
        can be used in the Programming activity.
    -   Often I go back and for on this one. Sometimes it is nicer to have less spaces
        in generated code when guests are viewing it. When no one else is reading it
        I love the spaces. Defaulting to what I like.

    ```lisp
    (help/set-org-babel-default-header-args :padline "yes")
    ```

8.  session

        ID: 8219A42A-E90F-418A-8EF0-EB150CF6D730

    > Preserve the state of code evaluation

    Configuration likely per Source-Block or System.

    For some situations, this may be the same for every source block for a
    particular language. R is a good example.

9.  shebang

        ID: 542185DD-4FD6-459A-B422-DA7B546FB292

    > Make tangled files executable

    Configuration likely per Source-Block or System.

10. tangle

        ID: EA716FC9-4A90-4F3E-ABD0-31FEA575C969

    > Toggle tangling and specify file name

    ```lisp
    (help/set-org-babel-default-header-args :tangle "no")
    ```

11. tangle-mode

        ID: 5F0B7157-2DC8-4AFD-8F26-4B21025A5ECE

    > Set permission of tangled files

    Configuration likely per Source-Block or System.

### Evaluating

    ID: ED23FF0B-1F90-435C-9B56-ACA06C1ACAE0

Org-Mode may evaluate all of the listed languages.

```lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (org . t)
   ;;
   (C . t)
   (R . t)
   (python . t)
   (sass . t)
   (scheme . t)
   (sql . t)
   ;;
   (latex . t)
   ;;
   (makefile . t)
   (shell . t)
   ;;
   (ditaa . t)
   (dot . t)
   (plantuml . t)))
```

1.  cache

        ID: 49B8BFE9-643B-450F-A8A1-20CE3079E215

    > Avoid re-evaluating unchanged code blocks

    Configuration likely per Source-Block or System.

    Default `no` is correct for nearly every scenario.

2.  colnames

        ID: 4D683007-14AE-4A7D-A506-E2301FD32E82

    > Handle column names in tables

    Configuration likely per Source-Block or System.

3.  dir

        ID: CD1494F1-0A2A-44D0-9955-0D0501AF1539

    > Specify the default (possibly remote) directory for code block execution

    Configuration likely per Source-Block or System.

4.  epilogue

        ID: CA7F5086-9D4B-4847-9449-3231CE027804

    > Text to append to code block body

    See Prologue.

5.  eval

        ID: 0329BACE-2C99-4BB3-A7A5-7C800EF53FAD

    > Limit evaluation of specific code blocks

    Never evaluate source-blocks or in-line-source-blocks **on export**.

    ```lisp
    (help/set-org-babel-default-header-args :eval "never-export")
    (help/set-org-babel-default-inline-header-args :eval "never-export")
    ```

    Never evaluate in-line-source-blocks **on export**.

    ```lisp
    (setq org-export-babel-evaluate nil)
    ```

6.  file

        ID: 80824708-62AF-4337-A517-828DA22D1FCA

    > Specify a path for file output

    Configuration likely per Source-Block or System.

7.  file-desc

        ID: 6F9A2745-7118-469E-9FDB-4B327C02E5FA

    > Specify a description for file results

    Configuration likely per Source-Block or System.

8.  file-ext

        ID: 0716A48E-9227-44FD-B1FA-185DF6545E91

    > Specify an extension for file output

    Configuration likely per Source-Block or System.

9.  hlines
