Org-Mode_Fundamentals.html

<li><a id="orgaa5186b"></a><a id="orgmode:gcr:vela:721F4E5E-A343-4D7C-A3A3-12A544B3A273"></a>hlines<br ><div class="outline-text-5" id="text-1-1-4-9">
<pre class="example">
ID: orgmode:gcr:vela:721F4E5E-A343-4D7C-A3A3-12A544B3A273
</pre>

<blockquote>
<p>
Handle horizontal lines in tables
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org66cd762"></a><a id="orgmode:gcr:vela:D0DDFE88-1B41-4A67-A5F4-88B1B35A7513"></a>output-dir<br ><div class="outline-text-5" id="text-1-1-4-10">
<pre class="example">
ID: orgmode:gcr:vela:D0DDFE88-1B41-4A67-A5F4-88B1B35A7513
</pre>

<blockquote>
<p>
Specify a directory to write file output to
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>

<p>
One example is a System where <b>all</b> intermediate results are stored to individual
files.
</p>
</div></li>

<li><a id="org6eab526"></a><a id="orgmode:gcr:vela:1A4DEC98-C735-4D88-8261-6AD13C495EF2"></a>post<br ><div class="outline-text-5" id="text-1-1-4-11">
<pre class="example">
ID: orgmode:gcr:vela:1A4DEC98-C735-4D88-8261-6AD13C495EF2
</pre>

<blockquote>
<p>
Post processing of code block results
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org77be306"></a><a id="orgmode:gcr:vela:3D1780E0-2E6D-428C-916D-BFB10E79C76F"></a>prologue<br ><div class="outline-text-5" id="text-1-1-4-12">
<pre class="example">
ID: orgmode:gcr:vela:3D1780E0-2E6D-428C-916D-BFB10E79C76F
</pre>

<blockquote>
<p>
Text to prepend to code block body
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>

<p>
For some situations, this may be the same for every source block for a
particular language. The user manual described <code>gnuplot</code>, which often shows up on
the list and the solution is to <code>reset</code> the session.
</p>

<p>
Another example, say that you&rsquo;ve got a bunch of R Source-Blocks and you want to
be able to rearrange them as you please. You want to be sure that there are no
dependencies between them on bindings created in the workspace. Set <code>prologue</code>
to <code>rm(list = ls())</code>.
</p>

<p>
Epilgue works hand-in-hand with this.
</p>
</div></li>

<li><a id="org9d75784"></a><a id="orgmode:gcr:vela:2755571E-113B-436E-9EEC-26618A55A27E"></a>results<br ><div class="outline-text-5" id="text-1-1-4-13">
<pre class="example">
ID: orgmode:gcr:vela:2755571E-113B-436E-9EEC-26618A55A27E
</pre>

<blockquote>
<p>
Specify the type of results and how they will be collected and handled
</p>
</blockquote>

<p>
Ways to configure <code>:results</code>: <code class="src src-emacs-lisp">(apply '* (<span class="org-keyword">-keep</span> 'cdr '((Collection . 2) (Type . 4) (Format . 7) (Handling . 4))))
</code> 224.
</p>

<p>
This system stores the results of evaluation in the source document. It believes
that the results are critical to the research.
</p>

<p>
Keep the document as close to being executable as possible; make it very visible
when it is not.
</p>

<ul class="org-ul">
<li>Collection
<ul class="org-ul">
<li><code>value</code>: Functions have a single result. So do Source-Blocks.</li>
</ul></li>
<li>Type
<ul class="org-ul">
<li><code>table</code>:</li>
<li>Tables are the best type because
<ul class="org-ul">
<li>Dimensions make them human-readable in text.</li>
<li>Work with Babel LP.</li>
<li>Appear as lists to programming languages.</li>
<li>Weaves well.</li>
<li>Inline Source-Blocks disallow tables so use scalars instead.</li>
</ul></li>
</ul></li>
<li>Format
<ul class="org-ul">
<li><code>drawer</code>: Enable results replacement</li>
</ul></li>
<li>Handling
<ul class="org-ul">
<li><code>replace</code>: Replace theme each time you evaluate the block.</li>
</ul></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org8314f0d">(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/org-sb-results-cfg</span> <span class="org-string">"value table drawer replace"</span>)
(help/set-org-babel-default-header-args <span class="org-builtin">:results</span> help/org-sb-results-cfg)
</pre>
</div>


<p>
Their format will show that they are results. Inline source blocks
automatically get formatted as verbatim. For some reason, this only needs to
be configured as <code>replace</code> to work unlike normal source blocks. Copying the
configuration from normal source blocks here breaks the replacement
functionality.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org6919fed">(<span class="org-keyword">defconst</span> <span class="org-variable-name">help/org-isb-results-cfg</span> <span class="org-string">"replace"</span>)
(help/set-org-babel-default-inline-header-args <span class="org-builtin">:results</span> help/org-isb-results-cfg)
</pre>
</div>
</div></li>

<li><a id="orge627c91"></a><a id="orgmode:gcr:vela:B184A507-1B03-4096-A4D8-E50A1DA047DB"></a>rownames<br ><div class="outline-text-5" id="text-1-1-4-14">
<pre class="example">
ID: orgmode:gcr:vela:B184A507-1B03-4096-A4D8-E50A1DA047DB
</pre>

<blockquote>
<p>
Handle row names in tables
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="orge3e5e03"></a><a id="orgmode:gcr:vela:F1336AAA-68EF-4E87-B253-458103B6FF2F"></a>sep<br ><div class="outline-text-5" id="text-1-1-4-15">
<pre class="example">
ID: orgmode:gcr:vela:F1336AAA-68EF-4E87-B253-458103B6FF2F
</pre>

<blockquote>
<p>
Delimiter for writing tabular results outside Org
</p>
</blockquote>

<p>
Configuration likely per Source-Block or System.
</p>
</div></li>

<li><a id="org30a9767"></a><a id="orgmode:gcr:vela:3B4D638C-82EE-47F3-835C-52B2F03620A0"></a>var<br ><div class="outline-text-5" id="text-1-1-4-16">
<pre class="example">
ID: orgmode:gcr:vela:3B4D638C-82EE-47F3-835C-52B2F03620A0
</pre>

<blockquote>
<p>
Pass arguments to code blocks
</p>
</blockquote>

<ul class="org-ul">
<li><b>The</b> most revealing of the power of Org-Mode&rsquo;s LP offering</li>
<li>Values-by-reference
<ul class="org-ul">
<li>Table</li>
<li>List</li>
<li>Source-Block without and with parameters</li>
<li>Literal-Block</li>
</ul></li>
<li>Idexable variable values</li>
<li>Emacs Lisp evaluation of variables</li>
</ul>
</div></li></ol>
</div>
