Org-Mode_Fundamentals.md

        ID: 721F4E5E-A343-4D7C-A3A3-12A544B3A273

    > Handle horizontal lines in tables

    Configuration likely per Source-Block or System.

10. output-dir

        ID: D0DDFE88-1B41-4A67-A5F4-88B1B35A7513

    > Specify a directory to write file output to

    Configuration likely per Source-Block or System.

    One example is a System where **all** intermediate results are stored to individual
    files.

11. post

        ID: 1A4DEC98-C735-4D88-8261-6AD13C495EF2

    > Post processing of code block results

    Configuration likely per Source-Block or System.

12. prologue

        ID: 3D1780E0-2E6D-428C-916D-BFB10E79C76F

    > Text to prepend to code block body

    Configuration likely per Source-Block or System.

    For some situations, this may be the same for every source block for a
    particular language. The user manual described `gnuplot`, which often shows up on
    the list and the solution is to `reset` the session.

    Another example, say that you&rsquo;ve got a bunch of R Source-Blocks and you want to
    be able to rearrange them as you please. You want to be sure that there are no
    dependencies between them on bindings created in the workspace. Set `prologue`
    to `rm(list = ls())`.

    Epilgue works hand-in-hand with this.

13. results

        ID: 2755571E-113B-436E-9EEC-26618A55A27E

    > Specify the type of results and how they will be collected and handled

    Ways to configure `:results`: 224.

    This system stores the results of evaluation in the source document. It believes
    that the results are critical to the research.

    Keep the document as close to being executable as possible; make it very visible
    when it is not.

    -   Collection
        -   `value`: Functions have a single result. So do Source-Blocks.
    -   Type
        -   `table`:
        -   Tables are the best type because
            -   Dimensions make them human-readable in text.
            -   Work with Babel LP.
            -   Appear as lists to programming languages.
            -   Weaves well.
            -   Inline Source-Blocks disallow tables so use scalars instead.
    -   Format
        -   `drawer`: Enable results replacement
    -   Handling
        -   `replace`: Replace theme each time you evaluate the block.

    ```lisp
    (defconst help/org-sb-results-cfg "value table drawer replace")
    (help/set-org-babel-default-header-args :results help/org-sb-results-cfg)
    ```

    Their format will show that they are results. Inline source blocks
    automatically get formatted as verbatim. For some reason, this only needs to
    be configured as `replace` to work unlike normal source blocks. Copying the
    configuration from normal source blocks here breaks the replacement
    functionality.

    ```lisp
    (defconst help/org-isb-results-cfg "replace")
    (help/set-org-babel-default-inline-header-args :results help/org-isb-results-cfg)
    ```

14. rownames

        ID: B184A507-1B03-4096-A4D8-E50A1DA047DB

    > Handle row names in tables

    Configuration likely per Source-Block or System.

15. sep

        ID: F1336AAA-68EF-4E87-B253-458103B6FF2F

    > Delimiter for writing tabular results outside Org

    Configuration likely per Source-Block or System.

16. var

        ID: 3B4D638C-82EE-47F3-835C-52B2F03620A0

    > Pass arguments to code blocks

    -   **The** most revealing of the power of Org-Mode&rsquo;s LP offering
    -   Values-by-reference
        -   Table
        -   List
        -   Source-Block without and with parameters
        -   Literal-Block
    -   Idexable variable values
    -   Emacs Lisp evaluation of variables
