Org-Mode_Fundamentals.org
*** Weaving
   :PROPERTIES:
   :ID:       orgmode:gcr:vela:F71DD8BA-B853-4903-A348-400E13C0E6F8
   :END:

Help the reader make sense of the document by displaying it's internal
properties.

#+NAME: 71BFB4A2-DABD-4621-A6E0-C3CAECD34BC4
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-with-properties t)
#+END_SRC

- Stop your flow to monitor the export for errors
  - <2016-01-19 Tue> Expect it to start weaves for all weavers asynchronously.
    Does not do so; main thread is blocked until weaves complete.

#+NAME: 49FDDABE-7999-4F51-BD93-969187A220D7
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-in-background nil)
#+END_SRC

Make sure that exported files are Unicode UTF-8.

#+NAME: 07E50259-E68C-465E-9387-9984220CEB69
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-coding-system 'utf-8)
#+END_SRC

Do not preserve line-breaks when exporting instead let the destination
format handle it as it sees fit. This doesn't work like I had expected and makes
me wonder what I am confused about here. When I export to HTML text containing
linebreaks no longer has linebreaks. This is what I expect. When I export that
same text to a buffer though, the line breaks are included. Currently I use
=sacha/unfill-paragraph= on that code.

#+NAME: 18CD863D-F01D-44F8-9B4D-A9FC016EDC79
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-preserve-breaks nil)
#+END_SRC

When exporting anything, do not insert the exported content into the kill ring.

#+NAME: F0703ECD-DB1D-47BF-BF1A-52336FE0C5D8
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-copy-to-kill-ring nil)
#+END_SRC

By default I never want a table of contents generated. It is so easy to enable
it with a property, it will be fine to turn it off.

#+NAME: 5BCA100F-6AC1-454B-9F48-31B5A67CB587
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-with-toc nil)
#+END_SRC

On export, maintain the literal spacing as found in the source block. Obviously
this is important for make-files. It is really important everywhere because
anything else would violate the law of least surprise.

#+NAME: 5ACDD0B0-2B6F-4F71-BFDF-2D2D1D91B573
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-src-preserve-indentation t)
#+END_SRC

Maximize flexibility for weaving operations during export.

#+NAME: A2FF8367-4A6A-444C-BB2E-F5AA494E33B5
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-export-allow-bind-keywords t)
#+END_SRC

Disable element caching because it might break weaves via [[https://lists.gnu.org/archive/html/emacs-orgmode/2015-09/msg00646.html][this thread]].

#+NAME: E44782C1-A02D-4D4A-982C-9F0908773CF9
#+BEGIN_SRC emacs-lisp :results output silent
(setq org-element-use-cache nil)
#+END_SRC

**** exports
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:57B3786B-017F-4F6E-89F9-05642304F3B6
    :END:

#+BEGIN_QUOTE
Export code and/or results
#+END_QUOTE

Always share source blocks and their results. Whether or not to generate a
result for a particular source block is configured per-block. If you don't want
to share a result for a source block then disable storage of results on that
block.

#+NAME: 72A5FF8F-6597-4523-A604-B499B439A103
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :exports "both")
#+END_SRC

Use inline Source-Blocks to provide values read as part of the document. Don't
show their source code. Allows inline Source-Blocks to function as /rich/ macros
when combined with ~org-sbe~.

#+NAME: 4EA406BB-7D8F-447A-BE18-48FE241A3930
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-inline-header-args :exports "results")
#+END_SRC

**** wrap
    :PROPERTIES:
    :ID:       orgmode:gcr:vela:94D6B3BE-5DA1-499A-B5C7-A6B71710A1EA
    :END:

#+BEGIN_QUOTE
Mark source block evaluation results
#+END_QUOTE

Inline-Source-Blocks are recognizable by their =verbatim= font. They do not
interrupt the flow. Source-Blocks are their own entities. They stand out. Their
results need to be visibly noticeably different for the reader by making them
=EXAMPLE= special blocks.

#+NAME: 7DA47704-25D2-4812-A838-7FE29E9F88FE
#+BEGIN_SRC emacs-lisp :results output silent
(help/set-org-babel-default-header-args :wrap "EXAMPLE")
#+END_SRC

Diagramming languages require =RESULTS= output for exporting.

#+NAME: 0F18A334-A192-4DA5-A897-9D7F3E15C64B
#+BEGIN_SRC emacs-lisp
(help/set-org-babel-default-header-args:ditaa :wrap "RESULTS")
(help/set-org-babel-default-header-args:dot :wrap "RESULTS")
(help/set-org-babel-default-header-args:plantuml :wrap "RESULTS")
#+END_SRC
