Org-Mode_Fundamentals.html

<div id="outline-container-org1ed25d7" class="outline-4">
<h4 id="org1ed25d7"><a id="orgmode:gcr:vela:F71DD8BA-B853-4903-A348-400E13C0E6F8"></a><span class="section-number-4">1.1.5</span> Weaving</h4>
<div class="outline-text-4" id="text-1-1-5">
<pre class="example">
ID: orgmode:gcr:vela:F71DD8BA-B853-4903-A348-400E13C0E6F8
</pre>

<p>
Help the reader make sense of the document by displaying it&rsquo;s internal
properties.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org112c53a">(setq org-export-with-properties t)
</pre>
</div>

<ul class="org-ul">
<li>Stop your flow to monitor the export for errors
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-19 Tue&gt; </span></span> Expect it to start weaves for all weavers asynchronously.
Does not do so; main thread is blocked until weaves complete.</li>
</ul></li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgf5cc8f6">(setq org-export-in-background nil)
</pre>
</div>

<p>
Make sure that exported files are Unicode UTF-8.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orge452c98">(setq org-export-coding-system 'utf-8)
</pre>
</div>

<p>
Do not preserve line-breaks when exporting instead let the destination
format handle it as it sees fit. This doesn&rsquo;t work like I had expected and makes
me wonder what I am confused about here. When I export to HTML text containing
linebreaks no longer has linebreaks. This is what I expect. When I export that
same text to a buffer though, the line breaks are included. Currently I use
<code>sacha/unfill-paragraph</code> on that code.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org3831a1f">(setq org-export-preserve-breaks nil)
</pre>
</div>

<p>
When exporting anything, do not insert the exported content into the kill ring.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org88fac10">(setq org-export-copy-to-kill-ring nil)
</pre>
</div>

<p>
By default I never want a table of contents generated. It is so easy to enable
it with a property, it will be fine to turn it off.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orga0470a1">(setq org-export-with-toc nil)
</pre>
</div>

<p>
On export, maintain the literal spacing as found in the source block. Obviously
this is important for make-files. It is really important everywhere because
anything else would violate the law of least surprise.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org92ef96b">(setq org-src-preserve-indentation t)
</pre>
</div>

<p>
Maximize flexibility for weaving operations during export.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgba9b00d">(setq org-export-allow-bind-keywords t)
</pre>
</div>

<p>
Disable element caching because it might break weaves via <a href="https://lists.gnu.org/archive/html/emacs-orgmode/2015-09/msg00646.html">this thread</a>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgbdf696f">(setq org-element-use-cache nil)
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="orgf8e079f"></a><a id="orgmode:gcr:vela:57B3786B-017F-4F6E-89F9-05642304F3B6"></a>exports<br ><div class="outline-text-5" id="text-1-1-5-1">
<pre class="example">
ID: orgmode:gcr:vela:57B3786B-017F-4F6E-89F9-05642304F3B6
</pre>

<blockquote>
<p>
Export code and/or results
</p>
</blockquote>

<p>
Always share source blocks and their results. Whether or not to generate a
result for a particular source block is configured per-block. If you don&rsquo;t want
to share a result for a source block then disable storage of results on that
block.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org21aef00">(help/set-org-babel-default-header-args <span class="org-builtin">:exports</span> <span class="org-string">"both"</span>)
</pre>
</div>

<p>
Use inline Source-Blocks to provide values read as part of the document. Don&rsquo;t
show their source code. Allows inline Source-Blocks to function as <i>rich</i> macros
when combined with <code>org-sbe</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="orgbd6967d">(help/set-org-babel-default-inline-header-args <span class="org-builtin">:exports</span> <span class="org-string">"results"</span>)
</pre>
</div>
</div></li>

<li><a id="orgf924c23"></a><a id="orgmode:gcr:vela:94D6B3BE-5DA1-499A-B5C7-A6B71710A1EA"></a>wrap<br ><div class="outline-text-5" id="text-1-1-5-2">
<pre class="example">
ID: orgmode:gcr:vela:94D6B3BE-5DA1-499A-B5C7-A6B71710A1EA
</pre>

<blockquote>
<p>
Mark source block evaluation results
</p>
</blockquote>

<p>
Inline-Source-Blocks are recognizable by their <code>verbatim</code> font. They do not
interrupt the flow. Source-Blocks are their own entities. They stand out. Their
results need to be visibly noticeably different for the reader by making them
<code>EXAMPLE</code> special blocks.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org78946e2">(help/set-org-babel-default-header-args <span class="org-builtin">:wrap</span> <span class="org-string">"EXAMPLE"</span>)
</pre>
</div>

<p>
Diagramming languages require <code>RESULTS</code> output for exporting.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="org25627de">(help/set-org-babel-default-header-args:ditaa <span class="org-builtin">:wrap</span> <span class="org-string">"RESULTS"</span>)
(help/set-org-babel-default-header-args:dot <span class="org-builtin">:wrap</span> <span class="org-string">"RESULTS"</span>)
(help/set-org-babel-default-header-args:plantuml <span class="org-builtin">:wrap</span> <span class="org-string">"RESULTS"</span>)
</pre>
</div>
</div></li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grant Rettke</p>
<p class="date">Created: 2016-09-01 Thu 19:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
