Org-Mode_Fundamentals.md

### Weaving

    ID: F71DD8BA-B853-4903-A348-400E13C0E6F8

Help the reader make sense of the document by displaying it&rsquo;s internal
properties.

```lisp
(setq org-export-with-properties t)
```

-   Stop your flow to monitor the export for errors
    -   <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-01-19 Tue&gt; </span></span> Expect it to start weaves for all weavers asynchronously.
        Does not do so; main thread is blocked until weaves complete.

```lisp
(setq org-export-in-background nil)
```

Make sure that exported files are Unicode UTF-8.

```lisp
(setq org-export-coding-system 'utf-8)
```

Do not preserve line-breaks when exporting instead let the destination
format handle it as it sees fit. This doesn&rsquo;t work like I had expected and makes
me wonder what I am confused about here. When I export to HTML text containing
linebreaks no longer has linebreaks. This is what I expect. When I export that
same text to a buffer though, the line breaks are included. Currently I use
`sacha/unfill-paragraph` on that code.

```lisp
(setq org-export-preserve-breaks nil)
```

When exporting anything, do not insert the exported content into the kill ring.

```lisp
(setq org-export-copy-to-kill-ring nil)
```

By default I never want a table of contents generated. It is so easy to enable
it with a property, it will be fine to turn it off.

```lisp
(setq org-export-with-toc nil)
```

On export, maintain the literal spacing as found in the source block. Obviously
this is important for make-files. It is really important everywhere because
anything else would violate the law of least surprise.

```lisp
(setq org-src-preserve-indentation t)
```

Maximize flexibility for weaving operations during export.

```lisp
(setq org-export-allow-bind-keywords t)
```

Disable element caching because it might break weaves via [this thread](https://lists.gnu.org/archive/html/emacs-orgmode/2015-09/msg00646.html).

```lisp
(setq org-element-use-cache nil)
```

1.  exports

        ID: 57B3786B-017F-4F6E-89F9-05642304F3B6

    > Export code and/or results

    Always share source blocks and their results. Whether or not to generate a
    result for a particular source block is configured per-block. If you don&rsquo;t want
    to share a result for a source block then disable storage of results on that
    block.

    ```lisp
    (help/set-org-babel-default-header-args :exports "both")
    ```

    Use inline Source-Blocks to provide values read as part of the document. Don&rsquo;t
    show their source code. Allows inline Source-Blocks to function as *rich* macros
    when combined with `org-sbe`.

    ```lisp
    (help/set-org-babel-default-inline-header-args :exports "results")
    ```

2.  wrap

        ID: 94D6B3BE-5DA1-499A-B5C7-A6B71710A1EA

    > Mark source block evaluation results

    Inline-Source-Blocks are recognizable by their `verbatim` font. They do not
    interrupt the flow. Source-Blocks are their own entities. They stand out. Their
    results need to be visibly noticeably different for the reader by making them
    `EXAMPLE` special blocks.

    ```lisp
    (help/set-org-babel-default-header-args :wrap "EXAMPLE")
    ```

    Diagramming languages require `RESULTS` output for exporting.

    ```lisp
    (help/set-org-babel-default-header-args:ditaa :wrap "RESULTS")
    (help/set-org-babel-default-header-args:dot :wrap "RESULTS")
    (help/set-org-babel-default-header-args:plantuml :wrap "RESULTS")
    ```
